# IsExtruded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RuledFace..::..IsExtruded Property
RuledFace Class See Also
---
Determines if this is an extruded ruled surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsExtruded { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsExtruded As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsExtruded {
	bool get ();
}
```

# See Also
RuledFace Class
Autodesk.Revit.DB Namespace